app/controllers/api/v1/sessions_controller.rb

  def create
    @member = Member.find_by_email(params[:username])
    if @member&.authenticate(params[:password])
      token = JsonWebToken.encode(user_id: @member.id)
      time = Time.now + 24.hours.to_i
      @member.token = token
      @member.save
---
SELECT "members".* FROM "members" WHERE "members"."email" = ? LIMIT ?  [["email", "super@psb.com"], ["LIMIT", 1]]
UPDATE "members" SET "updated_at" = ?, "token" = ? WHERE "members"."id" = ?  [["updated_at", "2021-09-09 08:29:30.142339"], ["token", "eyJhbGciOiJIUzI1NiJ9.eyJ1c2VyX2lkIjoxLCJleHAiOjE2MzEyNjI1NzB9.eifz0qAb9H7t0lzQGQf5sfw9ikvwSdyH35E5oZRf95o"], ["id", 1]]