app/models/movie.rb

  def self.get_data_movie
    request = res = RestClient.get 'https://api.themoviedb.org/3/trending/all/week?api_key=d90e430a19e15325653e0520e310e424'
    response = JSON.parse(request.body)
    response["results"].each do |data|
      movie = Movie.create(
          name: data["name"].present? ? data["name"] : data["title"] ,
          rating: data["vote_average"].to_f,
          overview: data["overview"],
          poster_path: "https://image.tmdb.org/t/p/original#{data['poster_path']}",
          first_air_date: data["first_air_date"],
          backdrop_path: "https://image.tmdb.org/t/p/original#{data['backdrop_path']}",
          release_date: data["release_date"],
          media_type: data["media_type"])
      data["genre_ids"].each do |genre|
        GenresMovie.create(movie_id: movie.id, genre_id: genre)
---
INSERT INTO "movies" ("name", "rating", "overview", "poster_path", "first_air_date", "backdrop_path", "media_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "genres_movies" ("movie_id", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["movie_id", 81], ["genre_id", 80], ["created_at", "2021-09-09 08:04:39.670927"], ["updated_at", "2021-09-09 08:04:39.670927"]]

  def self.get_all_data
    movies = Movie.includes(:genres)
    data = []
    movies.each do |movie|
      data << {
          id: movie.id,
          name: movie.name,
          rating: movie.rating,
          overview: movie.overview,
          poster_path: movie.poster_path,
          backdrop_path: movie.backdrop_path,
          media_type: movie.media_type,
          first_air_date: movie.first_air_date,
          release_date: movie.release_date,
          genres: movie.genres.map{|a| {id: a.id, name: a.name}}}
---
SELECT "genres".* FROM "genres" WHERE "genres"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["id", 80], ["id", 18], ["id", 28], ["id", 12], ["id", 14], ["id", 35], ["id", 53], ["id", 27], ["id", 10749], ["id", 16], ["id", 10759], ["id", 10765], ["id", 878], ["id", 9648]]
SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" LIMIT ?  [["LIMIT", 3]]
SELECT "genres".* FROM "genres" INNER JOIN "genres_movies" ON "genres"."id" = "genres_movies"."genre_id" WHERE "genres_movies"."movie_id" = ?  [["movie_id", 61]]